stromata_structure = { "stromata": {
    "Στρώματα": {
        "url": "https://www.fylliana.gr/stromata/stromata",
        "valid_colors": ['Χρώμα[]=10'],
        "valid_materials": ['Υλικό[]=2886', 'Υλικό[]=758', 'Υλικό[]=35'],
        "valid_features": ['Χαρακτηριστικά[]=2846', 'Χαρακτηριστικά[]=2845', 'Χαρακτηριστικά[]=2599', 'Χαρακτηριστικά[]=2844', 'Χαρακτηριστικά[]=2887', 'Χαρακτηριστικά[]=62', 'Χαρακτηριστικά[]=2587', 'Χαρακτηριστικά[]=2601', 'Χαρακτηριστικά[]=49', 'Χαρακτηριστικά[]=61', 'Χαρακτηριστικά[]=2605', 'Χαρακτηριστικά[]=60', 'Χαρακτηριστικά[]=2598', 'Χαρακτηριστικά[]=2603', 'Χαρακτηριστικά[]=2588', 'Χαρακτηριστικά[]=2610', 'Χαρακτηριστικά[]=2611', 'Χαρακτηριστικά[]=2592'],
        "valid_dimensions": ['Διαστάσεις[]=2872', 'Διαστάσεις[]=2873', 'Διαστάσεις[]=2874', 'Διαστάσεις[]=2875', 'Διαστάσεις[]=2876', 'Διαστάσεις[]=2877', 'Διαστάσεις[]=2871', 'Διαστάσεις[]=2878', 'Διαστάσεις[]=2879']
    },
    "Μαξιλάρια Ύπνου": {
        "url": "https://www.fylliana.gr/stromata/maxilari",
        "valid_colors": ['Χρώμα[]=10'],
        "valid_materials": ['Υλικό[]=35'],
        "valid_features": [],
        "valid_dimensions": []
    },
    "Λευκά είδη": {
        "url": "https://www.fylliana.gr/stromata/leyka-eidi",
        "valid_colors": ['Χρώμα[]=12'],
        "valid_materials": ['Υλικό[]=35'],
        "valid_features": [],
        "valid_dimensions": []
    },
    "Ανωστρώματα-Επιστρώματα-Παπλώματα": {
        "url": "https://www.fylliana.gr/stromata/paploma",
        "valid_colors": ['Χρώμα[]=73', 'Χρώμα[]=15', 'Χρώμα[]=10', 'Χρώμα[]=13'],
        "valid_materials": ['Υλικό[]=2905', 'Υλικό[]=2886', 'Υλικό[]=724', 'Υλικό[]=35'],
        "valid_features": [],
        "valid_dimensions": []
    }
   }
}


stroma_color={'Χρώμα[]=10': 'Λευκό', 'Χρώμα[]=12': 'Καφέ', 'Χρώμα[]=73': 'Ανοιχτό γκρι', 'Χρώμα[]=15': 'Γκρι', 'Χρώμα[]=13': 'Μπεζ'}

stroma_material={'Υλικό[]=2886': 'Memory Foam', 'Υλικό[]=758': 'Πολυουρεθανη', 'Υλικό[]=35': 'Ύφασμα', 'Υλικό[]=2905': 'Foam', 'Υλικό[]=724': 'Πολυεστέρας'}

stroma_feature={'Χαρακτηριστικά[]=2846': '2 όψεων', 'Χαρακτηριστικά[]=2845': 'Αεριζόμενο', 'Χαρακτηριστικά[]=2599': 'Ανατομικό', 'Χαρακτηριστικά[]=2844': 'Αντιβακτηριακό', 'Χαρακτηριστικά[]=2887': 'Αντιμικροβιακό', 'Χαρακτηριστικά[]=62': 'Διπλό', 'Χαρακτηριστικά[]=2587': 'Ελατήρια τύπου Bonnel', 'Χαρακτηριστικά[]=2601': 'Ελατήρια τύπου Pocket', 'Χαρακτηριστικά[]=49': 'Εσωτερικού χώρου', 'Χαρακτηριστικά[]=61': 'Ημίδιπλο', 'Χαρακτηριστικά[]=2605': 'Κετσές λευκός', 'Χαρακτηριστικά[]=60': 'Μονό', 'Χαρακτηριστικά[]=2598': 'Ορθοπεδικό', 'Χαρακτηριστικά[]=2603': 'Περιμετρικές κολώνες στήριξης', 'Χαρακτηριστικά[]=2588': 'Περιμετρικό λαμάκι στήριξης', 'Χαρακτηριστικά[]=2610': 'Σύστημα εξαερισμού', 'Χαρακτηριστικά[]=2611': 'Φερμουάρ', 'Χαρακτηριστικά[]=2592': 'Χειρολαβές', 'Χαρακτηριστικά[]=2084': 'Αδιάβροχο'}

stroma_dimensions ={'Διαστάσεις[]=2872' : '90x200εκ', 'Διαστάσεις[]=2873' : '100x200εκ' , 'Διαστάσεις[]=2874' : '110x200εκ', 'Διαστάσεις[]=2875' : '120x200εκ' , 'Διαστάσεις[]=2876' : '130x200εκ', 'Διαστάσεις[]=2877' : '140x200εκ', 'Διαστάσεις[]=2871' : '150x200εκ', 'Διαστάσεις[]=2878' : '160x200εκ', 'Διαστάσεις[]=2879' : '180x200εκ'}